cases/Re100/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     rhoPimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.5;

deltaT          1e-6;
adjustTimeStep  yes;
maxCo           0.2;
maxDeltaT       5e-6;

writeControl    runTime;
writeInterval   5e-4;
purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// 实时监控阻力/升力
functions
{
    forces
    {
        type            forces;
        libs            (forces);
        writeControl    runTime;
        writeInterval   0.02;
        patches         (walls);       // 监控整个 walls（含圆柱）
        rho             rho;
        rhoInf          1.225;
        CofR            (0 0 0);       // 参考点（圆柱中心）
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    runTime;
        writeInterval   0.02;
        patches         (walls);
        rho             rho;
        rhoInf          1.225;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
        magUInf         34.7188;
        lRef            0.1;             // D = 1 m
        Aref            1;             // 单位展向长度，按实际拉伸厚度调整
    }
}