cases/Re100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          154292;
        startFace       117743;
    }
    walls
    {
        type            wall;
        physicalType    wall;
        nFaces          356;
        startFace       272035;
    }
    outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          40;
        startFace       272391;
    }
    inlet
    {
        type            patch;
        physicalType    inlet;
        nFaces          40;
        startFace       272431;
    }
)

// ************************************************************************* //
