cases/Re100/constant/thermophysicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object thermophysicalProperties; }

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.965;
    }
    thermodynamics
    {
        Cp          1006;
        Hf          0;
    }
    transport
    {
        mu          1.85e-05;
        Pr          0.71;
    }
}
