cases/Re100/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (34.7188 0 0);   // Ma=0.1, a=sqrt(gamma*R*T) at 300 K

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (34.7188 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (34.7188 0 0);
    }
    walls                       // 上下壁面 + 圆柱面统一 no-slip
    {
        type            noSlip;
    }
    frontAndBack                // 2D 空面
    {
        type            empty;
    }
}