cases/Re100/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }

dimensions      [1 -1 -2 0 0 0 0];   // 绝对压力
internalField   uniform 101769.038;  // 101325 + 444.038 (Pa)

boundaryField
{
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value uniform 101769.038;
    }
    walls
    {
        type zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}