cases/Re100/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    h
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    hFinal
    {
        $h;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors            1;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
    fields
    {
        p               1.0;
    }
    equations
    {
        U               1.0;
        h               1.0;
    }
}